[{"name":"Project Hail Mary: A Novel","author":"Andy Weir","image":"https://books.google.com/books/publisher/content/images/frontcover/-Ff2DwAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES BESTSELLER • A lone astronaut must save the earth from disaster in this “propulsive” (Entertainment Weekly) new science-based thriller from the bestselling author of The Martian.\n\n“An epic story of redemption, discovery and cool speculative sci-fi.”—USA Today\n\n“If you loved The Martian, you’ll go crazy for Weir’s latest.”—The Washington Post\n\nRyland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish.\n\nExcept that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it.\n\nAll he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company.\n\nHis crewmates dead, his memories fuzzily returning, Ryland realizes that an impossible task now confronts him. Hurtling through space on this tiny ship, it’s up to him to puzzle out an impossible scientific mystery—and conquer an extinction-level threat to our species.\n\nAnd with the clock ticking down and the nearest human being light-years away, he’s got to do it all alone.\n\nOr does he?\n\nAn irresistible interstellar adventure as only Andy Weir could deliver, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian—while taking us to places it never dreamed of going.","link":"https://play.google.com/store/books/details/Andy_Weir_Project_Hail_Mary?id=-Ff2DwAAQBAJ"},{"name":"To Selena, with Love: Commemorative Edition","author":"Chris Perez","image":"https://books.google.com/books/content/images/frontcover/agvzRX-2SPwC?fife=w200-h300","description":"Chris Perez tells the story of his relationship with music superstar Selena in this heartfelt tribute.\n\nOne of the most compelling and adored superstars in Latin music history, Selena was nothing short of a phenomenon who shared all of herself with her millions of devoted fans. Her tragic murder, at the young age of twenty-three, stripped the world of her talent and boundless potential, her tightly knit family of their beloved angel, and her husband, Chris Perez, of the greatest love he had ever known. \n\nFor over a decade, Chris held on to the only personal thing he had left from his late wife: the touching and sometimes painful memories of their very private bond. Now, for the first time, Chris opens up about their unbreakable friendship, forbidden relationship, and blossoming marriage, which were cut short by Selena’s unforgivable death. \n\nChris’s powerful story gives a rare glimpse into Selena’s sincerity and vulnerability when falling in love, strength and conviction when fighting for that love, and absolute resilience when finding peace and normalcy with her family’s acceptance of the only man she called her husband. While showcasing a side of Selena that has never been disclosed before and clarifying certain misconceptions about her life and death, To Selena, with Love is an everlasting love story that immortalizes the heart and soul of an extraordinary, unforgettable, and irreplaceable icon. \n\nIncludes exclusive photos!","link":"https://play.google.com/store/books/details/Chris_Perez_To_Selena_with_Love?id=agvzRX-2SPwC"},{"name":"The 48 Laws of Power","author":"Robert Greene","image":"https://books.google.com/books/content/images/frontcover/afCxg5sogvAC?fife=w200-h300","description":"Amoral, cunning, ruthless, and instructive, this multi-million-copy New York Times bestseller is the definitive manual for anyone interested in gaining, observing, or defending against ultimate control – from the author of The Laws of Human Nature. \n\nIn the book that People magazine proclaimed “beguiling” and “fascinating,” Robert Greene and Joost Elffers have distilled three thousand years of the history of power into 48 essential laws by drawing from the philosophies of Machiavelli, Sun Tzu, and Carl Von Clausewitz and also from the lives of figures ranging from Henry Kissinger to P.T. Barnum.\n \nSome laws teach the need for prudence (“Law 1: Never Outshine the Master”), others teach the value of confidence (“Law 28: Enter Action with Boldness”), and many recommend absolute self-preservation (“Law 15: Crush Your Enemy Totally”). Every law, though, has one thing in common: an interest in total domination. In a bold and arresting two-color package, The 48 Laws of Power is ideal whether your aim is conquest, self-defense, or simply to understand the rules of the game.","link":"https://play.google.com/store/books/details/Robert_Greene_The_48_Laws_of_Power?id=afCxg5sogvAC"},{"name":"21st Birthday","author":"James PattersonMaxine Paetro","image":"https://books.google.com/books/publisher/content/images/frontcover/AaECEAAAQBAJ?fife=w200-h300","description":"Detective Lindsay Boxer vows to protect a young woman from a serial killer long enough to see her twenty-first birthday. When young wife and mother Tara Burke goes missing with her baby girl, all eyes are on her husband, Lucas. He paints her not as a missing person but a wayward wife—until a gruesome piece of evidence turns the investigation criminal. \n \nWhile Chronicle reporter Cindy Thomas pursues the story and M.E. Claire Washburn harbors theories that run counter to the SFPD’s, ADA Yuki Castellano sizes Lucas up as a textbook domestic offender . . . who suddenly puts forward an unexpected suspect. If what Lucas tells law enforcement has even a grain of truth, there isn't a woman in the state of California who's safe from the reach of an unspeakable threat.","link":"https://play.google.com/store/books/details/James_Patterson_21st_Birthday?id=AaECEAAAQBAJ"},{"name":"The Last Thing He Told Me: A Novel","author":"Laura Dave","image":"https://books.google.com/books/publisher/content/images/frontcover/3s8DEAAAQBAJ?fife=w200-h300","description":"Instant #1 New York Times bestseller\nNow a Reese Witherspoon Book Club Selection!\n\nA gripping mystery about a woman who thinks she’s found the love of her life—until he disappears.\n\nBefore Owen Michaels disappears, he smuggles a note to his beloved wife of one year: Protect her. Despite her confusion and fear, Hannah Hall knows exactly to whom the note refers—Owen’s sixteen-year-old daughter, Bailey. Bailey, who lost her mother tragically as a child. Bailey, who wants absolutely nothing to do with her new stepmother.\n\nAs Hannah’s increasingly desperate calls to Owen go unanswered, as the FBI arrests Owen’s boss, as a US marshal and federal agents arrive at her Sausalito home unannounced, Hannah quickly realizes her husband isn’t who he said he was. And that Bailey just may hold the key to figuring out Owen’s true identity—and why he really disappeared.\n\nHannah and Bailey set out to discover the truth. But as they start putting together the pieces of Owen’s past, they soon realize they’re also building a new future—one neither of them could have anticipated.\n\nWith its breakneck pacing, dizzying plot twists, and evocative family drama, The Last Thing He Told Me is a riveting mystery, certain to shock you with its final, heartbreaking turn.","link":"https://play.google.com/store/books/details/Laura_Dave_The_Last_Thing_He_Told_Me?id=3s8DEAAAQBAJ"},{"name":"Rhythm of War","author":"Brandon Sanderson","image":"https://books.google.com/books/publisher/content/images/frontcover/QCPBDwAAQBAJ?fife=w200-h300","description":"An instant #1 New York Times Bestseller and a USA Today and Indie Bestseller!\n\nThe Stormlight Archive saga continues in Rhythm of War, the eagerly awaited sequel to Brandon Sanderson's #1 New York Times bestselling Oathbringer, from an epic fantasy writer at the top of his game.\n\nAfter forming a coalition of human resistance against the enemy invasion, Dalinar Kholin and his Knights Radiant have spent a year fighting a protracted, brutal war. Neither side has gained an advantage, and the threat of a betrayal by Dalinar’s crafty ally Taravangian looms over every strategic move.\n\nNow, as new technological discoveries by Navani Kholin’s scholars begin to change the face of the war, the enemy prepares a bold and dangerous operation. The arms race that follows will challenge the very core of the Radiant ideals, and potentially reveal the secrets of the ancient tower that was once the heart of their strength. \n\nAt the same time that Kaladin Stormblessed must come to grips with his changing role within the Knights Radiant, his Windrunners face their own problem: As more and more deadly enemy Fused awaken to wage war, no more honorspren are willing to bond with humans to increase the number of Radiants. Adolin and Shallan must lead the coalition’s envoy to the honorspren stronghold of Lasting Integrity and either convince the spren to join the cause against the evil god Odium, or personally face the storm of failure.\n\nOther Tor books by Brandon Sanderson\n\nThe Cosmere\n\nThe Stormlight Archive\nThe Way of Kings\nWords of Radiance\nEdgedancer (Novella)\nOathbringer\nRhythm of War\n\nThe Mistborn trilogy\nMistborn: The Final Empire\nThe Well of Ascension\nThe Hero of Ages\n\nMistborn: The Wax and Wayne series\nAlloy of Law\nShadows of Self\nBands of Mourning\n\nCollection\nArcanum Unbounded\n\nOther Cosmere novels\nElantris\nWarbreaker\n\nThe Alcatraz vs. the Evil Librarians series\nAlcatraz vs. the Evil Librarians\nThe Scrivener's Bones\nThe Knights of Crystallia\nThe Shattered Lens\nThe Dark Talent\n\nThe Rithmatist series\nThe Rithmatist\n\nOther books by Brandon Sanderson\n\nThe Reckoners\nSteelheart\nFirefight\nCalamity\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Brandon_Sanderson_Rhythm_of_War?id=QCPBDwAAQBAJ"},{"name":"Rhythm of War","author":"Brandon Sanderson","image":"https://books.google.com/books/publisher/content/images/frontcover/QCPBDwAAQBAJ?fife=w200-h300","description":"An instant #1 New York Times Bestseller and a USA Today and Indie Bestseller!\n\nThe Stormlight Archive saga continues in Rhythm of War, the eagerly awaited sequel to Brandon Sanderson's #1 New York Times bestselling Oathbringer, from an epic fantasy writer at the top of his game.\n\nAfter forming a coalition of human resistance against the enemy invasion, Dalinar Kholin and his Knights Radiant have spent a year fighting a protracted, brutal war. Neither side has gained an advantage, and the threat of a betrayal by Dalinar’s crafty ally Taravangian looms over every strategic move.\n\nNow, as new technological discoveries by Navani Kholin’s scholars begin to change the face of the war, the enemy prepares a bold and dangerous operation. The arms race that follows will challenge the very core of the Radiant ideals, and potentially reveal the secrets of the ancient tower that was once the heart of their strength. \n\nAt the same time that Kaladin Stormblessed must come to grips with his changing role within the Knights Radiant, his Windrunners face their own problem: As more and more deadly enemy Fused awaken to wage war, no more honorspren are willing to bond with humans to increase the number of Radiants. Adolin and Shallan must lead the coalition’s envoy to the honorspren stronghold of Lasting Integrity and either convince the spren to join the cause against the evil god Odium, or personally face the storm of failure.\n\nOther Tor books by Brandon Sanderson\n\nThe Cosmere\n\nThe Stormlight Archive\nThe Way of Kings\nWords of Radiance\nEdgedancer (Novella)\nOathbringer\nRhythm of War\n\nThe Mistborn trilogy\nMistborn: The Final Empire\nThe Well of Ascension\nThe Hero of Ages\n\nMistborn: The Wax and Wayne series\nAlloy of Law\nShadows of Self\nBands of Mourning\n\nCollection\nArcanum Unbounded\n\nOther Cosmere novels\nElantris\nWarbreaker\n\nThe Alcatraz vs. the Evil Librarians series\nAlcatraz vs. the Evil Librarians\nThe Scrivener's Bones\nThe Knights of Crystallia\nThe Shattered Lens\nThe Dark Talent\n\nThe Rithmatist series\nThe Rithmatist\n\nOther books by Brandon Sanderson\n\nThe Reckoners\nSteelheart\nFirefight\nCalamity\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Brandon_Sanderson_Rhythm_of_War?id=QCPBDwAAQBAJ"},{"name":"The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life","author":"Mark Manson","image":"https://books.google.com/books/publisher/content/images/frontcover/yng_CwAAQBAJ?fife=w200-h300","description":"#1 New York Times Bestseller\nOver 1 million copies sold\nIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people.\nFor decades, we’ve been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let’s be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected American society and spoiled a generation, rewarding them with gold medals just for showing up. \nManson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek. \nThere are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.\n","link":"https://play.google.com/store/books/details/Mark_Manson_The_Subtle_Art_of_Not_Giving_a_F_ck?id=yng_CwAAQBAJ"},{"name":"Ocean Prey","author":"John Sandford","image":"https://books.google.com/books/publisher/content/images/frontcover/YxjzDwAAQBAJ?fife=w200-h300","description":"Fan-favorite heroes Lucas Davenport and Virgil Flowers join forces on a deadly maritime case in the remarkable new novel from #1 New York Times-bestselling author John Sandford.\n\nAn off-duty Coast Guardsman is fishing with his family when he calls in some suspicious behavior from a nearby boat. It's a snazzy craft, slick and outfitted with extra horsepower, and is zipping along until it slows to pick up a surfaced diver . . . a diver who was apparently alone, without his own boat, in the middle of the ocean. None of it makes sense unless there's something hinky going on, and his hunch is proved right when all three Guardsmen who come out to investigate are shot and killed.\n\nThey're federal officers killed on the job, which means the case is the FBI's turf. When the FBI's investigation stalls out, they call in Lucas Davenport. And when his case turns lethal, Davenport will need to bring in every asset he can claim, including a detective with a fundamentally criminal mind: Virgil Flowers.","link":"https://play.google.com/store/books/details/John_Sandford_Ocean_Prey?id=YxjzDwAAQBAJ"},{"name":"Ocean Prey","author":"John Sandford","image":"https://books.google.com/books/publisher/content/images/frontcover/YxjzDwAAQBAJ?fife=w200-h300","description":"Fan-favorite heroes Lucas Davenport and Virgil Flowers join forces on a deadly maritime case in the remarkable new novel from #1 New York Times-bestselling author John Sandford.\n\nAn off-duty Coast Guardsman is fishing with his family when he calls in some suspicious behavior from a nearby boat. It's a snazzy craft, slick and outfitted with extra horsepower, and is zipping along until it slows to pick up a surfaced diver . . . a diver who was apparently alone, without his own boat, in the middle of the ocean. None of it makes sense unless there's something hinky going on, and his hunch is proved right when all three Guardsmen who come out to investigate are shot and killed.\n\nThey're federal officers killed on the job, which means the case is the FBI's turf. When the FBI's investigation stalls out, they call in Lucas Davenport. And when his case turns lethal, Davenport will need to bring in every asset he can claim, including a detective with a fundamentally criminal mind: Virgil Flowers.","link":"https://play.google.com/store/books/details/John_Sandford_Ocean_Prey?id=YxjzDwAAQBAJ"},{"name":"Yearbook","author":"Seth Rogen","image":"https://books.google.com/books/publisher/content/images/frontcover/W4qODwAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES BESTSELLER • “Rogen’s candid collection of sidesplitting essays . . . thrives at both explaining and encapsulating a generational comedic voice.”—The Washington Post\n\nA collection of funny personal essays from one of the writers of Superbad and Pineapple Express and one of the producers of The Disaster Artist, Neighbors, and The Boys. (All of these words have been added to help this book show up in people’s searches using the wonders of algorithmic technology. Thanks for bearing with us!)\n \nHi! I’m Seth! I was asked to describe my book, Yearbook, for the inside flap (which is a gross phrase) and for websites and shit like that, so… here it goes!!!\n \nYearbook is a collection of true stories that I desperately hope are just funny at worst, and life-changingly amazing at best. (I understand that it’s likely the former, which is a fancy “book” way of saying “the first one.”) \n \nI talk about my grandparents, doing stand-up comedy as a teenager, bar mitzvahs, and Jewish summer camp, and tell way more stories about doing drugs than my mother would like. I also talk about some of my adventures in Los Angeles, and surely say things about other famous people that will create a wildly awkward conversation for me at a party one day.\n \nI hope you enjoy the book should you buy it, and if you don’t enjoy it, I’m sorry. If you ever see me on the street and explain the situation, I’ll do my best to make it up to you.","link":"https://play.google.com/store/books/details/Seth_Rogen_Yearbook?id=W4qODwAAQBAJ"},{"name":"Dune","author":"Frank Herbert","image":"https://books.google.com/books/content/images/frontcover/p1MULH7JsTQC?fife=w200-h300","description":"SOON TO BE A MAJOR MOTION PICTURE directed by Denis Villeneuve, starring Timothée Chalamet, Josh Brolin, Jason Momoa, Zendaya, Rebecca Ferguson, Oscar Isaac, Javier Bardem, Dave Bautista, Stellan Skarsgård, and Charlotte Rampling.\n\nFrank Herbert’s classic masterpiece—a triumph of the imagination and one of the bestselling science fiction novels of all time.\n\nSet on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for....\n\nWhen House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream. \n\nA stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.","link":"https://play.google.com/store/books/details/Frank_Herbert_Dune?id=p1MULH7JsTQC"},{"name":"Dune","author":"Frank Herbert","image":"https://books.google.com/books/content/images/frontcover/p1MULH7JsTQC?fife=w200-h300","description":"SOON TO BE A MAJOR MOTION PICTURE directed by Denis Villeneuve, starring Timothée Chalamet, Josh Brolin, Jason Momoa, Zendaya, Rebecca Ferguson, Oscar Isaac, Javier Bardem, Dave Bautista, Stellan Skarsgård, and Charlotte Rampling.\n\nFrank Herbert’s classic masterpiece—a triumph of the imagination and one of the bestselling science fiction novels of all time.\n\nSet on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for....\n\nWhen House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream. \n\nA stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.","link":"https://play.google.com/store/books/details/Frank_Herbert_Dune?id=p1MULH7JsTQC"},{"name":"The Soulmate Equation","author":"Christina Lauren","image":"https://books.google.com/books/publisher/content/images/frontcover/pPgDEAAAQBAJ?fife=w200-h300","description":"The New York Times bestselling author of The Unhoneymooners returns with a witty and effervescent novel about what happens when two people with everything on the line are thrown together by science—or is it fate? Perfect for fans of The Rosie Project and One Plus One.\n\nSingle mom Jessica Davis is a data and statistics wizard, but no amount of number crunching can convince her to step back into the dating world. Raised by her grandparents—who now help raise her seven-year-old daughter, Juno—Jess has been left behind too often to feel comfortable letting anyone in. After all, her father was never around, her hard-partying mother disappeared when she was six, and her ex decided he wasn’t “father material” before Juno was even born. Jess holds her loved ones close, but working constantly to stay afloat is hard...and lonely. \n\nBut then Jess hears about GeneticAlly, a buzzy new DNA-based matchmaking company that’s predicted to change dating forever. Finding a soulmate through DNA? The reliability of numbers: This Jess understands. \n\nAt least she thought she did, until her test shows an unheard-of 98 percent compatibility with another subject in the database: one of GeneticAlly’s founders, Dr. River Peña. This is one number she can’t wrap her head around, because she already knows Dr. Peña. The stuck-up, stubborn man is without a doubt not her soulmate. But GeneticAlly has a proposition: Get to know him and we’ll pay you. Jess—who is barely making ends meet—is in no position to turn it down, despite her skepticism about the project and her dislike for River. As the pair are dragged from one event to the next as the “Diamond Match” that could launch GeneticAlly’s valuation sky-high, Jess begins to realize that there might be more to the scientist—and the science behind a soulmate—than she thought.\n\nFunny, warm, and full of heart, The Soulmate Equation proves that the delicate balance between fate and choice can never be calculated","link":"https://play.google.com/store/books/details/Christina_Lauren_The_Soulmate_Equation?id=pPgDEAAAQBAJ"},{"name":"You Will Get Through This Night","author":"Daniel Howell","image":"https://books.google.com/books/publisher/content/images/frontcover/Der8DwAAQBAJ?fife=w200-h300","description":"A practical guide to taking control of your mental health for today, tomorrow, and the days after, from the #1 New York Times bestselling author and beloved entertainer. \n‘There’s a moment at the end of every day, where the world falls away and you are left alone with your thoughts. A reckoning, when the things you have been pushing to the background, come forward and demand your attention.’\nWritten by Daniel Howell, in consultation with a qualified psychologist, in an entertaining and personal way from the perspective of someone who has been through it all—this no-nonsense book gives you the tools to understand your mind so you can be in control and really live. Split into three chapters for each stage of the journey:\nThis Night - how to get through your toughest moments and be prepared to face anything.\nTomorrow - small steps to change your thoughts and actions with a big impact on your life.\nThe Days After - help to look after yourself in the long term and not just survive, but thrive.\nYou will laugh and learn—but most of all, this book will assure you that even in your darkest times, there is always hope. \nYou will get through this night.\n","link":"https://play.google.com/store/books/details/Daniel_Howell_You_Will_Get_Through_This_Night?id=Der8DwAAQBAJ"},{"name":"Killing the Mob: The Fight Against Organized Crime in America","author":"Bill O'ReillyMartin Dugard","image":"https://books.google.com/books/publisher/content/images/frontcover/1K0HEAAAQBAJ?fife=w200-h300","description":"Instant #1 New York Times, Wall Street Journal, and Publishers Weekly bestseller!\n\nIn the tenth book in the multimillion-selling Killing series, Bill O’Reilly and Martin Dugard take on their most controversial subject yet: The Mob.\n\nKilling the Mob is the tenth book in Bill O'Reilly's #1 New York Times bestselling series of popular narrative histories, with sales of nearly 18 million copies worldwide, and over 320 weeks on the New York Times bestseller list.\n\nO’Reilly and co-author Martin Dugard trace the brutal history of 20th Century organized crime in the United States, and expertly plumb the history of this nation’s most notorious serial robbers, conmen, murderers, and especially, mob family bosses. Covering the period from the 1930s to the 1980s, O’Reilly and Dugard trace the prohibition-busting bank robbers of the Depression Era, such as John Dillinger, Bonnie & Clyde, Pretty Boy Floyd and Baby-Face Nelson. In addition, the authors highlight the creation of the Mafia Commission, the power struggles within the “Five Families,” the growth of the FBI under J. Edgar Hoover, the mob battles to control Cuba, Las Vegas and Hollywood, as well as the personal war between the U.S. Attorney General Bobby Kennedy and legendary Teamsters boss Jimmy Hoffa.\n\nO’Reilly and Dugard turn these legendary criminals and their true-life escapades into a read that rivals the most riveting crime novel. With Killing the Mob, their hit series is primed for its greatest success yet.","link":"https://play.google.com/store/books/details/Bill_O_Reilly_Killing_the_Mob?id=1K0HEAAAQBAJ"},{"name":"Ready Player Two","author":"Ernest Cline","image":"https://books.google.com/books/publisher/content/images/frontcover/FOHtDwAAQBAJ?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER • The highly anticipated sequel to the beloved worldwide bestseller Ready Player One, the near-future adventure that inspired the blockbuster Steven Spielberg film. \n  \nNAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE WASHINGTON POST • “The game is on again. . . . A great mix of exciting fantasy and threatening fact.”—The Wall Street Journal\n\nAN UNEXPECTED QUEST. TWO WORLDS AT STAKE. ARE YOU READY? \n\nDays after winning OASIS founder James Halliday’s contest, Wade Watts makes a discovery that changes everything.\n\nHidden within Halliday’s vaults, waiting for his heir to find, lies a technological advancement that will once again change the world and make the OASIS a thousand times more wondrous—and addictive—than even Wade dreamed possible.\n \nWith it comes a new riddle, and a new quest—a last Easter egg from Halliday, hinting at a mysterious prize.\n \nAnd an unexpected, impossibly powerful, and dangerous new rival awaits, one who’ll kill millions to get what he wants.\n \nWade’s life and the future of the OASIS are again at stake, but this time the fate of humanity also hangs in the balance.\n \nLovingly nostalgic and wildly original as only Ernest Cline could conceive it, Ready Player Two takes us on another imaginative, fun, action-packed adventure through his beloved virtual universe, and jolts us thrillingly into the future once again.","link":"https://play.google.com/store/books/details/Ernest_Cline_Ready_Player_Two?id=FOHtDwAAQBAJ"},{"name":"Ready Player Two","author":"Ernest Cline","image":"https://books.google.com/books/publisher/content/images/frontcover/FOHtDwAAQBAJ?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER • The highly anticipated sequel to the beloved worldwide bestseller Ready Player One, the near-future adventure that inspired the blockbuster Steven Spielberg film. \n  \nNAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE WASHINGTON POST • “The game is on again. . . . A great mix of exciting fantasy and threatening fact.”—The Wall Street Journal\n\nAN UNEXPECTED QUEST. TWO WORLDS AT STAKE. ARE YOU READY? \n\nDays after winning OASIS founder James Halliday’s contest, Wade Watts makes a discovery that changes everything.\n\nHidden within Halliday’s vaults, waiting for his heir to find, lies a technological advancement that will once again change the world and make the OASIS a thousand times more wondrous—and addictive—than even Wade dreamed possible.\n \nWith it comes a new riddle, and a new quest—a last Easter egg from Halliday, hinting at a mysterious prize.\n \nAnd an unexpected, impossibly powerful, and dangerous new rival awaits, one who’ll kill millions to get what he wants.\n \nWade’s life and the future of the OASIS are again at stake, but this time the fate of humanity also hangs in the balance.\n \nLovingly nostalgic and wildly original as only Ernest Cline could conceive it, Ready Player Two takes us on another imaginative, fun, action-packed adventure through his beloved virtual universe, and jolts us thrillingly into the future once again.","link":"https://play.google.com/store/books/details/Ernest_Cline_Ready_Player_Two?id=FOHtDwAAQBAJ"},{"name":"A Gambling Man","author":"David Baldacci","image":"https://books.google.com/books/publisher/content/images/frontcover/-SLuDwAAQBAJ?fife=w200-h300","description":"Aloysius Archer, the straight-talking World War II veteran fresh out of prison, returns in this riveting #1 New York Times bestselling thriller from David Baldacci.\n\nThe 1950s are on the horizon, and Archer is in dire need of a fresh start after a nearly fatal detour in Poca City. So Archer hops on a bus and begins the long journey out west to California, where rumor has it there is money to be made if you’re hard-working, lucky, criminal—or all three.\n \nAlong the way, Archer stops in Reno, where a stroke of fortune delivers him a wad of cash and an eye-popping blood-red 1939 Delahaye convertible—plus a companion for the final leg of the journey, an aspiring actress named Liberty Callahan who is planning to try her luck in Hollywood. But when the two arrive in Bay Town, California, Archer quickly discovers that the hordes of people who flocked there seeking fame and fortune landed in a false paradise that instead caters to their worst addictions and fears.\n \nArcher’s first stop is a P.I. office where he is hoping to apprentice with a legendary private eye and former FBI agent named Willie Dash. He lands the job, and immediately finds himself in the thick of a potential scandal: a blackmail case involving a wealthy well-connected politician running for mayor that soon spins into something even more sinister. As bodies begin falling, Archer and Dash must infiltrate the world of brothels, gambling dens, drug operations, and long-hidden secrets, descending into the rotten bones of a corrupt town that is selling itself as the promised land—but might actually be the road to perdition, and Archer’s final resting place.","link":"https://play.google.com/store/books/details/David_Baldacci_A_Gambling_Man?id=-SLuDwAAQBAJ"},{"name":"Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones","author":"James Clear","image":"https://books.google.com/books/publisher/content/images/frontcover/lFhbDwAAQBAJ?fife=w200-h300","description":"The #1 New York Times bestseller. Over 2 million copies sold!\n\nTiny Changes, Remarkable Results\n\nNo matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\n\nLearn how to:\n• make time for new habits (even when life gets crazy);\n• overcome a lack of motivation and willpower;\n• design your environment to make success easier;\n• get back on track when you fall off course;\n...and much more.\n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.","link":"https://play.google.com/store/books/details/James_Clear_Atomic_Habits?id=lFhbDwAAQBAJ"},{"name":"The Four Winds: A Novel","author":"Kristin Hannah","image":"https://books.google.com/books/publisher/content/images/frontcover/Vw_hDwAAQBAJ?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER \n#1 USA TODAY BESTSELLER\n#1 WALL STREET JOURNAL BESTSELLER\n#1 INDIE BESTSELLER\n\n\"The Four Winds seems eerily prescient in 2021 . . . Its message is galvanizing and hopeful: We are a nation of scrappy survivors. We’ve been in dire straits before; we will be again. Hold your people close.”—The New York Times\n\n\"A spectacular tour de force that shines a spotlight on the indispensable but often overlooked role of Greatest Generation women.\"—People\n\n\"Through one woman’s survival during the harsh and haunting Dust Bowl, master storyteller, Kristin Hannah, reminds us that the human heart and our Earth are as tough, yet as fragile, as a change in the wind.\" —Delia Owens, author of Where the Crawdads Sing\n\nFrom the number-one bestselling author of The Nightingale and The Great Alone comes a powerful American epic about love and heroism and hope, set during the Great Depression, a time when the country was in crisis and at war with itself, when millions were out of work and even the land seemed to have turned against them. \n\n“My land tells its story if you listen. The story of our family.”\n\nTexas, 1921. A time of abundance. The Great War is over, the bounty of the land is plentiful, and America is on the brink of a new and optimistic era. But for Elsa Wolcott, deemed too old to marry in a time when marriage is a woman’s only option, the future seems bleak. Until the night she meets Rafe Martinelli and decides to change the direction of her life. With her reputation in ruin, there is only one respectable choice: marriage to a man she barely knows.\n\nBy 1934, the world has changed; millions are out of work and drought has devastated the Great Plains. Farmers are fighting to keep their land and their livelihoods as crops fail and water dries up and the earth cracks open. Dust storms roll relentlessly across the plains. Everything on the Martinelli farm is dying, including Elsa’s tenuous marriage; each day is a desperate battle against nature and a fight to keep her children alive.\n\nIn this uncertain and perilous time, Elsa—like so many of her neighbors—must make an agonizing choice: fight for the land she loves or leave it behind and go west, to California, in search of a better life for her family.\n\nThe Four Winds is a rich, sweeping novel that stunningly brings to life the Great Depression and the people who lived through it—the harsh realities that divided us as a nation and the enduring battle between the haves and the have-nots. A testament to hope, resilience, and the strength of the human spirit to survive adversity, The Four Winds is an indelible portrait of America and the American dream, as seen through the eyes of one indomitable woman whose courage and sacrifice will come to define a generation.","link":"https://play.google.com/store/books/details/Kristin_Hannah_The_Four_Winds?id=Vw_hDwAAQBAJ"},{"name":"The Anthropocene Reviewed: Essays on a Human-Centered Planet","author":"John Green","image":"https://books.google.com/books/publisher/content/images/frontcover/ZPD4DwAAQBAJ?fife=w200-h300","description":"A deeply moving and insightful collection of personal essays from #1 bestselling author John Green.\n\nThe Anthropocene is the current geologic age, in which humans have profoundly reshaped the planet and its biodiversity. In this remarkable symphony of essays adapted and expanded from his groundbreaking podcast, bestselling author John Green reviews different facets of the human-centered planet on a five-star scale—from the QWERTY keyboard and sunsets to Canada geese and Penguins of Madagascar.\n\nFunny, complex, and rich with detail, the reviews chart the contradictions of contemporary humanity. As a species, we are both far too powerful and not nearly powerful enough, a paradox that came into sharp focus as we faced a global pandemic that both separated us and bound us together.\n\nJohn Green’s gift for storytelling shines throughout this masterful collection. The Anthropocene Reviewed is a open-hearted exploration of the paths we forge and an unironic celebration of falling in love with the world.","link":"https://play.google.com/store/books/details/John_Green_The_Anthropocene_Reviewed?id=ZPD4DwAAQBAJ"},{"name":"Star Wars: Thrawn Ascendancy (Book II: Greater Good)","author":"Timothy Zahn","image":"https://books.google.com/books/publisher/content/images/frontcover/OdMAEAAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES BESTSELLER • Thrawn and his allies race to save the Chiss Ascendancy from an unseen enemy in the second book in the epic Star Wars: Thrawn Ascendancy trilogy from bestselling author Timothy Zahn.\n\nThrawn’s latest triumph still rests newly on his shoulders. He has led the Chiss to victory and brought glory to the House of Mitth, but the true threat to the Ascendancy has not yet been extinguished. Their foes do not send threats or ultimatums, do not mass ships on the edge of the Chaos. Their weapons come cloaked in smiles and generosity: Gifts offered freely. Services granted unconditionally. \n\nAcross the Ascendancy, seemingly inconsequential events could herald the doom of the Chiss. As Thrawn and the Expansionary Defense Fleet rally to uncover the plot, they discover a chilling truth: Rather than invade Chiss capitals or pillage resources, their enemy strikes at the very foundation of the Ascendancy, seeking to widen the rifts between the Nine Ruling Families and the Forty Great Houses below. As rivalry and suspicion sow discord among allies, each warrior must decide what matters most to them: the security of their family or the survival of the Ascendancy itself.","link":"https://play.google.com/store/books/details/Timothy_Zahn_Star_Wars_Thrawn_Ascendancy_Book_II_G?id=OdMAEAAAQBAJ"},{"name":"Star Wars: Thrawn Ascendancy (Book II: Greater Good)","author":"Timothy Zahn","image":"https://books.google.com/books/publisher/content/images/frontcover/OdMAEAAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES BESTSELLER • Thrawn and his allies race to save the Chiss Ascendancy from an unseen enemy in the second book in the epic Star Wars: Thrawn Ascendancy trilogy from bestselling author Timothy Zahn.\n\nThrawn’s latest triumph still rests newly on his shoulders. He has led the Chiss to victory and brought glory to the House of Mitth, but the true threat to the Ascendancy has not yet been extinguished. Their foes do not send threats or ultimatums, do not mass ships on the edge of the Chaos. Their weapons come cloaked in smiles and generosity: Gifts offered freely. Services granted unconditionally. \n\nAcross the Ascendancy, seemingly inconsequential events could herald the doom of the Chiss. As Thrawn and the Expansionary Defense Fleet rally to uncover the plot, they discover a chilling truth: Rather than invade Chiss capitals or pillage resources, their enemy strikes at the very foundation of the Ascendancy, seeking to widen the rifts between the Nine Ruling Families and the Forty Great Houses below. As rivalry and suspicion sow discord among allies, each warrior must decide what matters most to them: the security of their family or the survival of the Ascendancy itself.","link":"https://play.google.com/store/books/details/Timothy_Zahn_Star_Wars_Thrawn_Ascendancy_Book_II_G?id=OdMAEAAAQBAJ"},{"name":"The Three-Body Problem","author":"Cixin Liu","image":"https://books.google.com/books/publisher/content/images/frontcover/ZrNzAwAAQBAJ?fife=w200-h300","description":"Soon to be a Netflix Original Series!\n\n“War of the Worlds for the 21st century.” – Wall Street Journal\n\nThe Three-Body Problem is the first chance for English-speaking readers to experience the Hugo Award-winning phenomenon from China's most beloved science fiction author, Liu Cixin.\n\nSet against the backdrop of China's Cultural Revolution, a secret military project sends signals into space to establish contact with aliens. An alien civilization on the brink of destruction captures the signal and plans to invade Earth. Meanwhile, on Earth, different camps start forming, planning to either welcome the superior beings and help them take over a world seen as corrupt, or to fight against the invasion. The result is a science fiction masterpiece of enormous scope and vision.\n\nThe Three-Body Problem Series\nThe Three-Body Problem\nThe Dark Forest\nDeath's End\n\nOther Books\nBall Lightning \nSupernova Era\nTo Hold Up The Sky (forthcoming)\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Cixin_Liu_The_Three_Body_Problem?id=ZrNzAwAAQBAJ"},{"name":"The Three-Body Problem","author":"Cixin Liu","image":"https://books.google.com/books/publisher/content/images/frontcover/ZrNzAwAAQBAJ?fife=w200-h300","description":"Soon to be a Netflix Original Series!\n\n“War of the Worlds for the 21st century.” – Wall Street Journal\n\nThe Three-Body Problem is the first chance for English-speaking readers to experience the Hugo Award-winning phenomenon from China's most beloved science fiction author, Liu Cixin.\n\nSet against the backdrop of China's Cultural Revolution, a secret military project sends signals into space to establish contact with aliens. An alien civilization on the brink of destruction captures the signal and plans to invade Earth. Meanwhile, on Earth, different camps start forming, planning to either welcome the superior beings and help them take over a world seen as corrupt, or to fight against the invasion. The result is a science fiction masterpiece of enormous scope and vision.\n\nThe Three-Body Problem Series\nThe Three-Body Problem\nThe Dark Forest\nDeath's End\n\nOther Books\nBall Lightning \nSupernova Era\nTo Hold Up The Sky (forthcoming)\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Cixin_Liu_The_Three_Body_Problem?id=ZrNzAwAAQBAJ"},{"name":"A Court of Silver Flames","author":"Sarah J. Maas","image":"https://books.google.com/books/publisher/content/images/frontcover/OdXvDwAAQBAJ?fife=w200-h300","description":"Sarah J. Maas's sexy, richly imagined series continues with the journey of Feyre's fiery sister, Nesta. \n\nNesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it.\n\nThe one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other. \n\nMeanwhile, the treacherous human queens who returned to the Continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might very well rely on Cassian and Nesta facing their haunting pasts.\n\nAgainst the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms.","link":"https://play.google.com/store/books/details/Sarah_J_Maas_A_Court_of_Silver_Flames?id=OdXvDwAAQBAJ"},{"name":"Finding Ashley: A Novel","author":"Danielle Steel","image":"https://books.google.com/books/publisher/content/images/frontcover/sNP0DwAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES BESTSELLER • In this blockbuster novel from Danielle Steel, two estranged sisters get the chance to connect again and right the wrongs of the past.\n\nMelissa Henderson is leading a quiet life. Once a bestselling author, she now pours all her energy into renovating a Victorian house nestled in the foothills of rural New England. Six years ago, she lost her young son to cancer, and her marriage dissolved. She stopped writing. It was only when she bought the old house that Melissa found a purpose, and came alive as she made it beautiful again.\n\nAfter a wildfire that threatens her home appears on the news, Melissa receives a call from her sister, Hattie. They were close once, but that was before Melissa withdrew from the world. Now Hattie, who became a nun at twenty-five, is determined to help Melissa turn a new page, even if it means reopening one of the most painful chapters of her life.\n\nAt sixteen, a pregnant Melissa was sent to a gloomy convent in Ireland to have— and give up—her baby, to spare the family shame. All these years later, Hattie feels compelled to embark on a journey that will change both their lives forever, and track down the child Melissa gave up.\n\nFinding Ashley is a masterpiece of contemporary drama and tells a gripping story of the strength of the human spirit to chase an impossible dream. It is the story of two strong, brave women turning wrenching loss into reconnection, and a family reunited after bringing dark secrets into the light.","link":"https://play.google.com/store/books/details/Danielle_Steel_Finding_Ashley?id=sNP0DwAAQBAJ"},{"name":"Afterparties: Stories","author":"Anthony Veasna So","image":"https://books.google.com/books/publisher/content/images/frontcover/_GQJEAAAQBAJ?fife=w200-h300","description":"A Roxane Gay's Audacious Book Club Pick!\nA Most Anticipated Book From: Vulture * LitHub * Harper's Bazaar * Elle * Buzzfeed\nA vibrant story collection about Cambodian-American life—immersive and comic, yet unsparing—that offers profound insight into the intimacy of queer and immigrant communities\nSeamlessly transitioning between the absurd and the tenderhearted, balancing acerbic humor with sharp emotional depth, Afterparties offers an expansive portrait of the lives of Cambodian-Americans. As the children of refugees carve out radical new paths for themselves in California, they shoulder the inherited weight of the Khmer Rouge genocide and grapple with the complexities of race, sexuality, friendship, and family.\nA high school badminton coach and failing grocery store owner tries to relive his glory days by beating a rising star teenage player. Two drunken brothers attend a wedding afterparty and hatch a plan to expose their shady uncle’s snubbing of the bride and groom. A queer love affair sparks between an older tech entrepreneur trying to launch a “safe space” app and a disillusioned young teacher obsessed with Moby-Dick. And in the sweeping final story, a nine-year-old child learns that his mother survived a racist school shooter.\nThe stories in Afterparties, “powered by So’s skill with the telling detail, are like beams of wry, affectionate light, falling from different directions on a complicated, struggling, beloved American community” (George Saunders).\n","link":"https://play.google.com/store/books/details/Anthony_Veasna_So_Afterparties?id=_GQJEAAAQBAJ"},{"name":"Local Woman Missing: A Novel","author":"Mary Kubica","image":"https://books.google.com/books/publisher/content/images/frontcover/Mu_yDwAAQBAJ?fife=w200-h300","description":"\"Dark and twisty, with white-knuckle tension and jaw-dropping surprises.\" —Riley Sager, New York Times bestselling author of Home Before Dark\n\nIn this smart and chilling thriller, master of suspense Mary Kubica takes domestic secrets to a whole new level, showing that some people will stop at nothing to keep the truth buried.\n\nPeople don't just disappear without a trace…\n\nShelby Tebow is the first to go missing. Not long after, Meredith Dickey and her six-year-old daughter, Delilah, vanish just blocks away from where Shelby was last seen, striking fear into their once-peaceful community. Are these incidents connected? After an elusive search that yields more questions than answers, the case eventually goes cold.\n\nNow, eleven years later, Delilah shockingly returns. Everyone wants to know what happened to her, but no one is prepared for what they'll find…\n\nLook for these other riveting thrillers by Mary Kubica:\nThe Good Girl\nPretty Baby\nDon't You Cry\nEvery Last Lie\nWhen the Lights Go Out\nThe Other Mrs.\n","link":"https://play.google.com/store/books/details/Mary_Kubica_Local_Woman_Missing?id=Mu_yDwAAQBAJ"},{"name":"Fugitive Telemetry","author":"Martha Wells","image":"https://books.google.com/books/publisher/content/images/frontcover/IhLjDwAAQBAJ?fife=w200-h300","description":"The New York Times bestselling security droid with a heart (though it wouldn't admit it!) is back in Fugitive Telemetry!\n\nHaving captured the hearts of readers across the globe (Annalee Newitz says it's \"one of the most humane portraits of a nonhuman I've ever read\") Murderbot has also established Martha Wells as one of the great SF writers of today.\n\nNo, I didn't kill the dead human. If I had, I wouldn't dump the body in the station mall.\n\nWhen Murderbot discovers a dead body on Preservation Station, it knows it is going to have to assist station security to determine who the body is (was), how they were killed (that should be relatively straightforward, at least), and why (because apparently that matters to a lot of people—who knew?) \n\nYes, the unthinkable is about to happen: Murderbot must voluntarily speak to humans!\n\nAgain!\n\nA new standalone adventure in the New York Times-bestselling, Hugo and Nebula Award winning series!\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Martha_Wells_Fugitive_Telemetry?id=IhLjDwAAQBAJ"},{"name":"Fugitive Telemetry","author":"Martha Wells","image":"https://books.google.com/books/publisher/content/images/frontcover/IhLjDwAAQBAJ?fife=w200-h300","description":"The New York Times bestselling security droid with a heart (though it wouldn't admit it!) is back in Fugitive Telemetry!\n\nHaving captured the hearts of readers across the globe (Annalee Newitz says it's \"one of the most humane portraits of a nonhuman I've ever read\") Murderbot has also established Martha Wells as one of the great SF writers of today.\n\nNo, I didn't kill the dead human. If I had, I wouldn't dump the body in the station mall.\n\nWhen Murderbot discovers a dead body on Preservation Station, it knows it is going to have to assist station security to determine who the body is (was), how they were killed (that should be relatively straightforward, at least), and why (because apparently that matters to a lot of people—who knew?) \n\nYes, the unthinkable is about to happen: Murderbot must voluntarily speak to humans!\n\nAgain!\n\nA new standalone adventure in the New York Times-bestselling, Hugo and Nebula Award winning series!\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Martha_Wells_Fugitive_Telemetry?id=IhLjDwAAQBAJ"},{"name":"12 Rules for Life: An Antidote to Chaos","author":"Jordan B. Peterson","image":"https://books.google.com/books/publisher/content/images/frontcover/TvEqDAAAQBAJ?fife=w200-h300","description":"#1 NATIONAL BESTSELLER \n\n#1 INTERNATIONAL BESTSELLER\n\nWhat does everyone in the modern world need to know? \n\nRenowned psychologist Jordan B. Peterson's answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research.\n\nHumorous, surprising and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street.\n\nWhat does the nervous system of the lowly lobster have to tell us about standing up straight (with our shoulders back) and about success in life? Why did ancient Egyptians worship the capacity to pay careful attention as the highest of gods? What dreadful paths do people tread when they become resentful, arrogant and vengeful? \n\nDr. Peterson journeys broadly, discussing discipline, freedom, adventure and responsibility, distilling the world's wisdom into 12 practical and profound rules for life. 12 Rules for Life shatters the modern commonplaces of science, faith and human nature, while transforming and ennobling the mind and spirit of its readers.","link":"https://play.google.com/store/books/details/Jordan_B_Peterson_12_Rules_for_Life?id=TvEqDAAAQBAJ"},{"name":"The Handmaid's Tale","author":"Margaret Atwood","image":"https://books.google.com/books/content/images/frontcover/ZrsVZKWJg4UC?fife=w200-h300","description":"Before The Testaments, there was The Handmaid’s Tale: an instant classic and eerily prescient cultural phenomenon, from “the patron saint of feminist dystopian fiction” (New York Times).\n\nThe Handmaid’s Tale is a novel of such power that the reader will be unable to forget its images and its forecast. Set in the near future, it describes life in what was once the United States and is now called the Republic of Gilead, a monotheocracy that has reacted to social unrest and a sharply declining birthrate by reverting to, and going beyond, the repressive intolerance of the original Puritans. The regime takes the Book of Genesis absolutely at its word, with bizarre consequences for the women and men in its population.\n\nThe story is told through the eyes of Offred, one of the unfortunate Handmaids under the new social order. In condensed but eloquent prose, by turns cool-eyed, tender, despairing, passionate, and wry, she reveals to us the dark corners behind the establishment’s calm facade, as certain tendencies now in existence are carried to their logical conclusions. The Handmaid’s Tale is funny, unexpected, horrifying, and altogether convincing. It is at once scathing satire, dire warning, and a tour de force. It is Margaret Atwood at her best.","link":"https://play.google.com/store/books/details/Margaret_Atwood_The_Handmaid_s_Tale?id=ZrsVZKWJg4UC"},{"name":"What Happened to You?: Conversations on Trauma, Resilience, and Healing","author":"Oprah WinfreyBruce D. Perry","image":"https://books.google.com/books/publisher/content/images/frontcover/_BreDwAAQBAJ?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER\n\nOur earliest experiences shape our lives far down the road, and What Happened to You? provides powerful scientific and emotional insights into the behavioral patterns so many of us struggle to understand.\n\n“Through this lens we can build a renewed sense of personal self-worth and ultimately recalibrate our responses to circumstances, situations, and relationships. It is, in other words, the key to reshaping our very lives.”—Oprah Winfrey\n\nThis book is going to change the way you see your life.\n\nHave you ever wondered \"Why did I do that?\" or \"Why can't I just control my behavior?\" Others may judge our reactions and think, \"What's wrong with that person?\" When questioning our emotions, it's easy to place the blame on ourselves; holding ourselves and those around us to an impossible standard. It's time we started asking a different question.\n\nThrough deeply personal conversations, Oprah Winfrey and renowned brain and trauma expert Dr. Bruce Perry offer a groundbreaking and profound shift from asking “What’s wrong with you?” to “What happened to you?” \n\nHere, Winfrey shares stories from her own past, understanding through experience the vulnerability that comes from facing trauma and adversity at a young age. In conversation throughout the book, she and Dr. Perry focus on understanding people, behavior, and ourselves. It’s a subtle but profound shift in our approach to trauma, and it’s one that allows us to understand our pasts in order to clear a path to our future—opening the door to resilience and healing in a proven, powerful way.","link":"https://play.google.com/store/books/details/Oprah_Winfrey_What_Happened_to_You?id=_BreDwAAQBAJ"},{"name":"Later","author":"Stephen King","image":"https://books.google.com/books/publisher/content/images/frontcover/hML0DwAAQBAJ?fife=w200-h300","description":"“Part detective tale, part thriller…touching and genuine.” —The New York Times\n\n#1 bestselling author Stephen King returns with a brand-new novel about the secrets we keep buried and the cost of unearthing them.\n\n\n#1 NEW YORK TIMES BESTSELLER\nTHE SUNDAY TIMES BESTSELLER\n\nSOMETIMES GROWING UP \n\nMEANS FACING YOUR DEMONS\n\nThe son of a struggling single mother, Jamie Conklin just wants an ordinary childhood. But Jamie is no ordinary child. Born with an unnatural ability his mom urges him to keep secret, Jamie can see what no one else can see and learn what no one else can learn. But the cost of using this ability is higher than Jamie can imagine – as he discovers when an NYPD detective draws him into the pursuit of a killer who has threatened to strike from beyond the grave. \n\nLATER is Stephen King at his finest, a terrifying and touching story of innocence lost and the trials that test our sense of right and wrong. With echoes of King’s classic novel It, LATER is a powerful, haunting, unforgettable exploration of what it takes to stand up to evil in all the faces it wears.","link":"https://play.google.com/store/books/details/Stephen_King_Later?id=hML0DwAAQBAJ"},{"name":"People We Meet on Vacation","author":"Emily Henry","image":"https://books.google.com/books/publisher/content/images/frontcover/xcL3DwAAQBAJ?fife=w200-h300","description":"THE #1 NEW YORK TIMES BESTSELLER! \n\nNamed a Most Anticipated Book of 2021 by Newsweek ∙ Oprah Magazine ∙ Marie Claire ∙ Parade ∙ PopSugar ∙ BookPage ∙ BookBub ∙ Betches ∙ SheReads ∙ Good Housekeeping ∙ BuzzFeed ∙ and more!\n\nTwo best friends. Ten summer trips. One last chance to fall in love. \n\nFrom the bestselling author of Beach Read comes a sparkling new novel that will leave you with the warm, hazy afterglow usually reserved for the best vacations.   \n\nPoppy and Alex. Alex and Poppy. They have nothing in common. She’s a wild child; he wears khakis. She has insatiable wanderlust; he prefers to stay home with a book. And somehow, ever since a fateful car share home from college many years ago, they are the very best of friends. For most of the year they live far apart—she’s in New York City, and he’s in their small hometown—but every summer, for a decade, they have taken one glorious week of vacation together. \n  \nUntil two years ago, when they ruined everything. They haven't spoken since. \n  \nPoppy has everything she should want, but she’s stuck in a rut. When someone asks when she was last truly happy, she knows, without a doubt, it was on that ill-fated, final trip with Alex. And so, she decides to convince her best friend to take one more vacation together—lay everything on the table, make it all right. Miraculously, he agrees. \n  \nNow she has a week to fix everything. If only she can get around the one big truth that has always stood quietly in the middle of their seemingly perfect relationship. What could possibly go wrong?","link":"https://play.google.com/store/books/details/Emily_Henry_People_We_Meet_on_Vacation?id=xcL3DwAAQBAJ"},{"name":"The Terminal List","author":"Jack Carr","image":"https://books.google.com/books/publisher/content/images/frontcover/0BwyDwAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES AND USA TODAY BESTSELLING AUTHOR\n\n“Take my word for it, James Reece is one rowdy motherf***er. Get ready!”—Chris Pratt, all around great guy and star of The Terminal List, coming to Amazon Prime\n\nA Navy SEAL has nothing left to live for and everything to kill for after he discovers that the American government is behind the deaths of his team in this ripped-from-the-headlines political thriller that is “so powerful, so pulse-pounding, so well-written—rarely do you read a debut novel this damn good” (Brad Thor, #1 New York Times bestselling author).\n\nOn his last combat deployment, Lieutenant Commander James Reece’s entire team was killed in a catastrophic ambush. But when those dearest to him are murdered on the day of his homecoming, Reece discovers that this was not an act of war by a foreign enemy but a conspiracy that runs to the highest levels of government.\n\nNow, with no family and free from the military’s command structure, Reece applies the lessons that he’s learned in over a decade of constant warfare toward avenging the deaths of his family and teammates. With breathless pacing and relentless suspense, Reece ruthlessly targets his enemies in the upper echelons of power without regard for the laws of combat or the rule of law.\n\nWith “crackerjack plotting, vivid characters both in and out of uniform, and a relentless pace to a worthy finish” (Stephen Hunter, #1 New York Times bestselling author), The Terminal List is perfect for fans of Vince Flynn, Brad Thor, and Nelson DeMille.","link":"https://play.google.com/store/books/details/Jack_Carr_The_Terminal_List?id=0BwyDwAAQBAJ"},{"name":"The Terminal List","author":"Jack Carr","image":"https://books.google.com/books/publisher/content/images/frontcover/0BwyDwAAQBAJ?fife=w200-h300","description":"NEW YORK TIMES AND USA TODAY BESTSELLING AUTHOR\n\n“Take my word for it, James Reece is one rowdy motherf***er. Get ready!”—Chris Pratt, all around great guy and star of The Terminal List, coming to Amazon Prime\n\nA Navy SEAL has nothing left to live for and everything to kill for after he discovers that the American government is behind the deaths of his team in this ripped-from-the-headlines political thriller that is “so powerful, so pulse-pounding, so well-written—rarely do you read a debut novel this damn good” (Brad Thor, #1 New York Times bestselling author).\n\nOn his last combat deployment, Lieutenant Commander James Reece’s entire team was killed in a catastrophic ambush. But when those dearest to him are murdered on the day of his homecoming, Reece discovers that this was not an act of war by a foreign enemy but a conspiracy that runs to the highest levels of government.\n\nNow, with no family and free from the military’s command structure, Reece applies the lessons that he’s learned in over a decade of constant warfare toward avenging the deaths of his family and teammates. With breathless pacing and relentless suspense, Reece ruthlessly targets his enemies in the upper echelons of power without regard for the laws of combat or the rule of law.\n\nWith “crackerjack plotting, vivid characters both in and out of uniform, and a relentless pace to a worthy finish” (Stephen Hunter, #1 New York Times bestselling author), The Terminal List is perfect for fans of Vince Flynn, Brad Thor, and Nelson DeMille.","link":"https://play.google.com/store/books/details/Jack_Carr_The_Terminal_List?id=0BwyDwAAQBAJ"},{"name":"Publication Manual of the American Psychological Association: 7th Edition","author":"American Psychological Association","image":"https://books.google.com/books/publisher/content/images/frontcover/48MkEAAAQBAJ?fife=w200-h300","description":"A WALL STREET JOURNAL BESTSELLER - The new 2020 copyright release of the Publication Manual of the American Psychological Association, Seventh Edition includes three different formats — spiral and tabbed, paperback, and hardcover, all of which are full-color. It is the official source for APA Style. With millions of copies sold worldwide in multiple languages, it is the style manual of choice for writers, researchers, editors, students, and educators in the social and behavioral sciences, natural sciences, nursing, communications, education, business, engineering, and other fields.\n \nKnown for its authoritative, easy-to-use reference and citation system, the Publication Manual also offers guidance on choosing the headings, tables, figures, language, and tone that will result in powerful, concise, and elegant scholarly communication. It guides users through the scholarly writing process—from the ethics of authorship to reporting research through publication. The seventh edition is an indispensable resource for students and professionals to achieve excellence in writing and make an impact with their work.\n \nThe seventh edition has been thoroughly revised and updated to reflect best practices in scholarly writing and publishing.\n\nAll formats are in full color, with a new tabbed spiral version\nImproved ease of navigation, with many additional numbered sections to help users quickly locate answers to their questions\nResources for students on writing and formatting annotated bibliographies, response papers, and other paper types as well as guidelines on citing course materials\nDedicated chapter for new users of APA Style covering paper elements and format, including sample papers for both professional authors and student writers\nNew chapter on journal article reporting standards that includes updates to reporting standards for quantitative research and the first-ever qualitative and mixed methods reporting standards in APA Style\nNew chapter on bias-free language guidelines for writing about people with respect and inclusivity in areas including age, disability, gender, participation in research, race and ethnicity, sexual orientation, socioeconomic status, and intersectionality\nMore than 100 new reference examples covering periodicals, books, audiovisual media, social media, webpages and websites, and legal resources\nMore than 40 new sample tables and figures\nExpanded guidance on ethical writing and publishing practices, including how to ensure the appropriate level of citation, avoid plagiarism and self-plagiarism, and navigate the publication process\nGuidelines that support accessibility for all users, including simplified reference, in-text citation, and heading formats as well as additional font options\nReference Examples\nAuthor Variations\n\nDate Variations\n\nTitle Variations\n\nSource Variations\n\nTextual Works\n\nData Sets, Software, and Tests\n\nAudiovisual Media\n\nOnline Media\n","link":"https://play.google.com/store/books/details/American_Psychological_Association_Publication_Man?id=48MkEAAAQBAJ"},{"name":"After","author":"Anna Todd","image":"https://books.google.com/books/publisher/content/images/frontcover/SL3QAwAAQBAJ?fife=w200-h300","description":"Now a major motion picture!\n\nExperience the internet's most talked-about book from Anna Todd, the writer Cosmopolitan called “the biggest literary phenomenon of her generation”—now with new exclusive material! \n\nThere was the time before Tessa met Hardin, and then there’s everything AFTER... Life will never be the same. #Hessa\n\nTessa is a good girl with a sweet, reliable boyfriend back home. She’s got direction, ambition, and a mother who’s intent on keeping her that way.\n\nBut she’s barely moved into her freshman dorm when she runs into Hardin. With his tousled brown hair, cocky British accent, and tattoos, Hardin is cute and different from what she’s used to.\n\nBut he’s also rude—to the point of cruelty, even. For all his attitude, Tessa should hate Hardin. And she does—until she finds herself alone with him in his room. Something about his dark mood grabs her, and when they kiss it ignites within her a passion she’s never known before.\n\nHe'll call her beautiful, then insist he isn’t the one for her and disappear again and again. Despite the reckless way he treats her, Tessa is compelled to dig deeper and find the real Hardin beneath all his lies. He pushes her away again and again, yet every time she pushes back, he only pulls her in deeper.\n\nTessa already has the perfect boyfriend. So why is she trying so hard to overcome her own hurt pride and Hardin's prejudice about nice girls like her?\n\nUnless...could this be love?","link":"https://play.google.com/store/books/details/Anna_Todd_After?id=SL3QAwAAQBAJ"},{"name":"After","author":"Anna Todd","image":"https://books.google.com/books/publisher/content/images/frontcover/SL3QAwAAQBAJ?fife=w200-h300","description":"Now a major motion picture!\n\nExperience the internet's most talked-about book from Anna Todd, the writer Cosmopolitan called “the biggest literary phenomenon of her generation”—now with new exclusive material! \n\nThere was the time before Tessa met Hardin, and then there’s everything AFTER... Life will never be the same. #Hessa\n\nTessa is a good girl with a sweet, reliable boyfriend back home. She’s got direction, ambition, and a mother who’s intent on keeping her that way.\n\nBut she’s barely moved into her freshman dorm when she runs into Hardin. With his tousled brown hair, cocky British accent, and tattoos, Hardin is cute and different from what she’s used to.\n\nBut he’s also rude—to the point of cruelty, even. For all his attitude, Tessa should hate Hardin. And she does—until she finds herself alone with him in his room. Something about his dark mood grabs her, and when they kiss it ignites within her a passion she’s never known before.\n\nHe'll call her beautiful, then insist he isn’t the one for her and disappear again and again. Despite the reckless way he treats her, Tessa is compelled to dig deeper and find the real Hardin beneath all his lies. He pushes her away again and again, yet every time she pushes back, he only pulls her in deeper.\n\nTessa already has the perfect boyfriend. So why is she trying so hard to overcome her own hurt pride and Hardin's prejudice about nice girls like her?\n\nUnless...could this be love?","link":"https://play.google.com/store/books/details/Anna_Todd_After?id=SL3QAwAAQBAJ"},{"name":"Mistborn Trilogy","author":"Brandon Sanderson","image":"https://books.google.com/books/content/images/frontcover/F8u01NaEZU0C?fife=w200-h300","description":"This discounted ebundle includes: Mistborn: The Final Empire, The Well of Ascension, The Hero of Ages\n\nFrom #1 New York Times bestselling author Brandon Sanderson, the Mistborn trilogy is a heist story of political intrigue and magical, martial-arts action.\n\nFor a thousand years the ash fell and no flowers bloomed. For a thousand years the Skaa slaved in misery and lived in fear. For a thousand years the Lord Ruler, the \"Sliver of Infinity,\" reigned with absolute power and ultimate terror, divinely invincible. This saga dares to ask a simple question: What if the hero of prophecy fails?\n\nMistborn: The Final Empire — Kelsier, a brilliant thief has turned his talents to the ultimate caper, with the Lord Ruler as the mark. Kel's plan is the ultimate long shot, until luck brings a ragged girl named Vin into the fold. But she will have to learn to trust if she is to master powers of which she never dreamed.\n\nThe Well of Ascension — Evil has been defeated; the war has just begun. Vin, the street urchin who has become the most powerful Mistborn in the land, and Elend Venture, the idealistic young nobleman who loves her, must build a healthy new society in the ashes of an empire.\n\nThe Hero of Ages — The Deepness has returned, along with unusually heavy ashfalls and powerful earthquakes. Humanity appears to be doomed. Vin and Eland investigate the past to save the future, and in the end, sacrifices must be made.\n\nOther Tor books by Brandon Sanderson\n\nThe Cosmere\n\nThe Stormlight Archive\nThe Way of Kings\nWords of Radiance\nEdgedancer (Novella)\nOathbringer \n\nThe Mistborn trilogy\nMistborn: The Final Empire\nThe Well of Ascension\nThe Hero of Ages\n\nMistborn: The Wax and Wayne series\nAlloy of Law\nShadows of Self\nBands of Mourning\n\nCollection\nArcanum Unbounded\n\nOther Cosmere novels\nElantris\nWarbreaker\n\nThe Alcatraz vs. the Evil Librarians series\nAlcatraz vs. the Evil Librarians\nThe Scrivener's Bones\nThe Knights of Crystallia\nThe Shattered Lens\nThe Dark Talent\n\nThe Rithmatist series\nThe Rithmatist\n\nOther books by Brandon Sanderson\n\nThe Reckoners\nSteelheart\nFirefight\nCalamity\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Brandon_Sanderson_Mistborn_Trilogy?id=F8u01NaEZU0C"},{"name":"Win","author":"Harlan Coben","image":"https://books.google.com/books/publisher/content/images/frontcover/eYTpDwAAQBAJ?fife=w200-h300","description":"In this #1 New York Times bestselling thriller from Harlan Coben, a dead man's secrets fall into the hands of a vigilante antihero—drawing him down a dangerous road.\n\nOver twenty years ago, the heiress Patricia Lockwood was abducted during a robbery of her family's estate, then locked inside an isolated cabin for months. Patricia escaped, but so did her captors — and the items stolen from her family were never recovered. \n\nUntil now. On the Upper West Side, a recluse is found murdered in his penthouse apartment, alongside two objects of note: a stolen Vermeer painting and a leather suitcase bearing the initials WHL3. For the first time in years, the authorities have a lead — not only on Patricia's kidnapping, but also on another FBI cold case — with the suitcase and painting both pointing them toward one man.\n\nWindsor Horne Lockwood III — or Win, as his few friends call him — doesn't know how his suitcase and his family's stolen painting ended up with a dead man. But his interest is piqued, especially when the FBI tells him that the man who kidnapped his cousin was also behind an act of domestic terrorism — and that the conspirators may still be at large. The two cases have baffled the FBI for decades, but Win has three things the FBI doesn't: a personal connection to the case; an ungodly fortune; and his own unique brand of justice. ","link":"https://play.google.com/store/books/details/Harlan_Coben_Win?id=eYTpDwAAQBAJ"},{"name":"The Final Twist","author":"Jeffery Deaver","image":"https://books.google.com/books/publisher/content/images/frontcover/jo__DwAAQBAJ?fife=w200-h300","description":"\"The master of ticking-bomb suspense\" (People) returns with a devilishly good thriller, and reward seeker Colter Shaw's most personal case to date.\n\nJust hours after the harrowing events of The Never Game and The Goodbye Man, Colter Shaw finds himself in San Francisco, where he has taken on the mission his father began years ago: finding a missing courier bag containing evidence that will bring down a corporate espionage firm responsible for hundreds, perhaps thousands, of deaths.\n\nFollowing the enigmatic clues his father left behind, Shaw plays cat and mouse with the company's sadistic enforcers, as he speeds from one gritty neighborhood in the City by the Bay to another. Suddenly, the job takes on a frightening urgency: Only by finding the courier bag can he expose the company and stop the murder of an entire family--slated to die in forty-eight hours.\n\nWith the help of an unexpected figure from his past, and with the enforcers closing the net, Shaw narrows in on the truth--and learns that the courier bag contains something unexpected: a secret that could only be described as catastrophic.\n\nFilled with dozens of twists and reversals, The Final Twist is a nonstop race against time to save the family.... and to keep the devastating secret Shaw has uncovered from falling into the wrong hands.","link":"https://play.google.com/store/books/details/Jeffery_Deaver_The_Final_Twist?id=jo__DwAAQBAJ"},{"name":"Ready Player One","author":"Ernest Cline","image":"https://books.google.com/books/content/images/frontcover/FY_HWAcm10MC?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER • Now a major motion picture directed by Steven Spielberg.\n\n“Enchanting . . . Willy Wonka meets The Matrix.”—USA Today • “As one adventure leads expertly to the next, time simply evaporates.”—Entertainment Weekly\n\nA world at stake. A quest for the ultimate prize. Are you ready?\n\nIn the year 2045, reality is an ugly place. The only time Wade Watts really feels alive is when he’s jacked into the OASIS, a vast virtual world where most of humanity spends their days.\n\nWhen the eccentric creator of the OASIS dies, he leaves behind a series of fiendish puzzles, based on his obsession with the pop culture of decades past. Whoever is first to solve them will inherit his vast fortune—and control of the OASIS itself. \n\nThen Wade cracks the first clue. Suddenly he’s beset by rivals who’ll kill to take this prize. The race is on—and the only way to survive is to win.\n\nNAMED ONE OF THE BEST BOOKS OF THE YEAR BY Entertainment Weekly • San Francisco Chronicle • Village Voice • Chicago Sun-Times • iO9 • The AV Club\n\n“Delightful . . . the grown-up’s Harry Potter.”—HuffPost\n\n“An addictive read . . . part intergalactic scavenger hunt, part romance, and all heart.”—CNN\n\n“A most excellent ride . . . Cline stuffs his novel with a cornucopia of pop culture, as if to wink to the reader.”—Boston Globe\n\n“Ridiculously fun and large-hearted . . . Cline is that rare writer who can translate his own dorky enthusiasms into prose that’s both hilarious and compassionate.”—NPR\n\n“[A] fantastic page-turner . . . starts out like a simple bit of fun and winds up feeling like a rich and plausible picture of future friendships in a world not too distant from our own.”—iO9\n\n","link":"https://play.google.com/store/books/details/Ernest_Cline_Ready_Player_One?id=FY_HWAcm10MC"},{"name":"Ready Player One","author":"Ernest Cline","image":"https://books.google.com/books/content/images/frontcover/FY_HWAcm10MC?fife=w200-h300","description":"#1 NEW YORK TIMES BESTSELLER • Now a major motion picture directed by Steven Spielberg.\n\n“Enchanting . . . Willy Wonka meets The Matrix.”—USA Today • “As one adventure leads expertly to the next, time simply evaporates.”—Entertainment Weekly\n\nA world at stake. A quest for the ultimate prize. Are you ready?\n\nIn the year 2045, reality is an ugly place. The only time Wade Watts really feels alive is when he’s jacked into the OASIS, a vast virtual world where most of humanity spends their days.\n\nWhen the eccentric creator of the OASIS dies, he leaves behind a series of fiendish puzzles, based on his obsession with the pop culture of decades past. Whoever is first to solve them will inherit his vast fortune—and control of the OASIS itself. \n\nThen Wade cracks the first clue. Suddenly he’s beset by rivals who’ll kill to take this prize. The race is on—and the only way to survive is to win.\n\nNAMED ONE OF THE BEST BOOKS OF THE YEAR BY Entertainment Weekly • San Francisco Chronicle • Village Voice • Chicago Sun-Times • iO9 • The AV Club\n\n“Delightful . . . the grown-up’s Harry Potter.”—HuffPost\n\n“An addictive read . . . part intergalactic scavenger hunt, part romance, and all heart.”—CNN\n\n“A most excellent ride . . . Cline stuffs his novel with a cornucopia of pop culture, as if to wink to the reader.”—Boston Globe\n\n“Ridiculously fun and large-hearted . . . Cline is that rare writer who can translate his own dorky enthusiasms into prose that’s both hilarious and compassionate.”—NPR\n\n“[A] fantastic page-turner . . . starts out like a simple bit of fun and winds up feeling like a rich and plausible picture of future friendships in a world not too distant from our own.”—iO9\n\n","link":"https://play.google.com/store/books/details/Ernest_Cline_Ready_Player_One?id=FY_HWAcm10MC"},{"name":"Winning: The Unforgiving Race to Greatness","author":"Tim S. Grover","image":"https://books.google.com/books/publisher/content/images/frontcover/udIDEAAAQBAJ?fife=w200-h300","description":"From the elite performance coach who authored the international bestseller Relentless and whose clients have included Michael Jordan, Kobe Bryant, and Dwyane Wade, comes this brutally honest formula for winning in business, sports, or any arena where the battle is fiercely unforgiving. \n\nIn Winning, Tim Grover shows why he is one of the world’s most sought-after mindset experts. Drawing on three decades of work with elite competitors, Grover strips away the cliches and rah-rah mentality that create mediocrity and challenges you to embrace reality with single-minded intensity. The prize? Massive success.\n\nWhether you’re an athlete with championship dreams, an entrepreneur building a business, a CEO managing an empire, a salesperson closing a deal, or simply a competitor determined to stand in the winner’s circle, Winning offers thirteen crucial principles for achieving unbeatable performance.\n\nThis book reveals the truth about the obstacles and challenges that stand between you and your goals: Winning never lies. Winning knows your secrets. Winning wages war in the battlefield of your mind. Winning wants all of you. And more.\n\nIf you’re addicted to the taste of success and crave more, then you’re ready for Winning’s results-driven performance strategy. And if you’re already winning and want to learn how to execute at a level that will establish you as one of the greatest—so you can own not just this moment, but the next, and the next—this book will show you the path.","link":"https://play.google.com/store/books/details/Tim_S_Grover_Winning?id=udIDEAAAQBAJ"},{"name":"While Justice Sleeps: A Novel","author":"Stacey Abrams","image":"https://books.google.com/books/publisher/content/images/frontcover/ZKgBEAAAQBAJ?fife=w200-h300","description":"INSTANT #1 NEW YORK TIMES BEST SELLER • From celebrated national leader and bestselling author Stacey Abrams, a gripping, complexly plotted thriller set within the halls of the U.S. Supreme Court.\n\n\"Brilliant and mesmerizing. Abrams follows in Dan Brown’s footprint with this masterfully plotted thriller that unfolds like the ultimate chess match—bold move to bolder move with lives hanging in the balance.\"—Lisa Gardner \n \n\"Stacey Abrams is a true novelist, and While Justice Sleeps is a first-class legal thriller, favorably compared to many of the best, starting with The Pelican Brief, which it brings to mind. It’s fast-paced and full of surprises—a terrific read.\"—Scott Turow\n\nAvery Keene, a brilliant young law clerk for the legendary Justice Howard Wynn, is doing her best to hold her life together—excelling in an arduous job with the court while also dealing with a troubled family. When the shocking news breaks that Justice Wynn—the cantankerous swing vote on many current high-profile cases—has slipped into a coma, Avery’s life turns upside down. She is immediately notified that Justice Wynn has left instructions for her to serve as his legal guardian and power of attorney. Plunged into an explosive role she never anticipated, Avery finds that Justice Wynn had been secretly researching one of the most controversial cases before the court—a proposed merger between an American biotech company and an Indian genetics firm, which promises to unleash breathtaking results in the medical field. She also discovers that Wynn suspected a dangerously related conspiracy that infiltrates the highest power corridors of Washington.\n \nAs political wrangling ensues in Washington to potentially replace the ailing judge whose life and survival Avery controls, she begins to unravel a carefully constructed, chesslike sequence of clues left behind by Wynn. She comes to see that Wynn had a much more personal stake in the controversial case and realizes his complex puzzle will lead her directly into harm’s way in order to find the truth. While Justice Sleeps is a cunningly crafted, sophisticated novel, layered with myriad twists and a vibrant cast of characters. Drawing on her astute inside knowledge of the court and political landscape, Stacey Abrams shows herself to be not only a force for good in politics and voter fairness but also a major new talent in suspense fiction.","link":"https://play.google.com/store/books/details/Stacey_Abrams_While_Justice_Sleeps?id=ZKgBEAAAQBAJ"},{"name":"How to Talk So Kids Will Listen & Listen So Kids Will Talk","author":"Adele FaberElaine Mazlish","image":"https://books.google.com/books/content/images/frontcover/LG69eA4wvKoC?fife=w200-h300","description":"“This parenting book actually made me a better parent.”—Lydia Kiesling, The New York Times\n\nFrom #1 New York Times bestselling authors, the ultimate “parenting bible” (The Boston Globe)—a timeless, beloved book on how to effectively communicate with your child.\n\nThis bestselling classic by internationally acclaimed experts on communication between parents and children includes fresh insights and suggestions, as well as the author’s time-tested methods to solve common problems and build foundations for lasting relationships, including innovative ways to:\n\n· Cope with your child’s negative feelings, such as frustration, anger, and disappointment\n· Express your strong feelings without being hurtful\n· Engage your child’s willing cooperation\n· Set firm limits and maintain goodwill\n· Use alternatives to punishment that promote self-discipline\n· Understand the difference between helpful and unhelpful praise\n· Resolve family conflicts peacefully\n\nEnthusiastically praised by parents and professionals around the world, Faber and Mazlish’s down-to-earth, respectful approach makes relationships with children of all ages less stressful and more rewarding.","link":"https://play.google.com/store/books/details/Adele_Faber_How_to_Talk_So_Kids_Will_Listen_Listen?id=LG69eA4wvKoC"},{"name":"Battle Ground","author":"Jim Butcher","image":"https://books.google.com/books/publisher/content/images/frontcover/lTzYDwAAQBAJ?fife=w200-h300","description":"THINGS ARE ABOUT TO GET SERIOUS FOR HARRY DRESDEN, CHICAGO’S ONLY PROFESSIONAL WIZARD, in the next entry in the #1 New York Times bestselling Dresden Files. \n\nHarry has faced terrible odds before. He has a long history of fighting enemies above his weight class. The Red Court of vampires. The fallen angels of the Order of the Blackened Denarius. The Outsiders.\n\nBut this time it’s different. A being more powerful and dangerous on an order of magnitude beyond what the world has seen in a millennium is coming. And she’s bringing an army. The Last Titan has declared war on the city of Chicago, and has come to subjugate humanity, obliterating any who stand in her way. \n\nHarry’s mission is simple but impossible: Save the city by killing a Titan. And the attempt will change Harry’s life, Chicago, and the mortal world forever.","link":"https://play.google.com/store/books/details/Jim_Butcher_Battle_Ground?id=lTzYDwAAQBAJ"},{"name":"Battle Ground","author":"Jim Butcher","image":"https://books.google.com/books/publisher/content/images/frontcover/lTzYDwAAQBAJ?fife=w200-h300","description":"THINGS ARE ABOUT TO GET SERIOUS FOR HARRY DRESDEN, CHICAGO’S ONLY PROFESSIONAL WIZARD, in the next entry in the #1 New York Times bestselling Dresden Files. \n\nHarry has faced terrible odds before. He has a long history of fighting enemies above his weight class. The Red Court of vampires. The fallen angels of the Order of the Blackened Denarius. The Outsiders.\n\nBut this time it’s different. A being more powerful and dangerous on an order of magnitude beyond what the world has seen in a millennium is coming. And she’s bringing an army. The Last Titan has declared war on the city of Chicago, and has come to subjugate humanity, obliterating any who stand in her way. \n\nHarry’s mission is simple but impossible: Save the city by killing a Titan. And the attempt will change Harry’s life, Chicago, and the mortal world forever.","link":"https://play.google.com/store/books/details/Jim_Butcher_Battle_Ground?id=lTzYDwAAQBAJ"},{"name":"The Song of Achilles: A Novel","author":"Madeline Miller","image":"https://books.google.com/books/content/images/frontcover/opC3d3ltQ94C?fife=w200-h300","description":"“At once a scholar’s homage to The Iliad and startlingly original work of art by an incredibly talented new novelist….A book I could not put down.”\n—Ann Patchett\n“Mary Renault lives again!” declares Emma Donoghue, author of Room, referring to The Song of Achilles, Madeline Miller’s thrilling, profoundly moving, and utterly unique retelling of the legend of Achilles and the Trojan War. \nA tale of gods, kings, immortal fame, and the human heart, The Song of Achilles is a dazzling literary feat that brilliantly reimagines Homer’s enduring masterwork, The Iliad. An action-packed adventure, an epic love story, a marvelously conceived and executed page-turner, Miller’s monumental debut novel has already earned resounding acclaim from some of contemporary fiction’s brightest lights—and fans of Mary Renault, Bernard Cornwell, Steven Pressfield, and Colleen McCullough’s Masters of Rome series will delight in this unforgettable journey back to ancient Greece in the Age of Heroes.\n","link":"https://play.google.com/store/books/details/Madeline_Miller_The_Song_of_Achilles?id=opC3d3ltQ94C"},{"name":"The Midnight Library: A Novel","author":"Matt Haig","image":"https://books.google.com/books/publisher/content/images/frontcover/nNjTDwAAQBAJ?fife=w200-h300","description":"The New York Times bestselling WORLDWIDE phenomenon \n \nWinner of the Goodreads Choice Award for Fiction | A Good Morning America Book Club Pick\n \n\"A feel-good book guaranteed to lift your spirits.\"—The Washington Post \n\nThe dazzling reader-favorite about the choices that go into a life well lived, from the acclaimed author of How To Stop Time and The Comfort Book.\n \nSomewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better?\n\nIn The Midnight Library, Matt Haig's enchanting blockbuster novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place.","link":"https://play.google.com/store/books/details/Matt_Haig_The_Midnight_Library?id=nNjTDwAAQBAJ"},{"name":"Unfu*k Yourself: Get Out of Your Head and into Your Life","author":"Gary John Bishop","image":"https://books.google.com/books/publisher/content/images/frontcover/UAjhDgAAQBAJ?fife=w200-h300","description":"Joining the ranks of The Life-Changing Magic of Not Giving a F*ck, The Subtle Art of Not Giving a F*ck, You Are a Badas*, and F*ck Feelings comes this refreshing, BS-free, self-empowerment guide that offers an honest, no-nonsense, tough-love approach to help you move past self-imposed limitations.\n\nAre you tired of feeling fu*ked up? If you are, Gary John Bishop has the answer. In this straightforward handbook, he gives you the tools and advice you need to demolish the slag weighing you down and become the truly unfu*ked version of yourself. ''Wake up to the miracle you are,'' he directs. ''Here's what you've forgotten: You're a fu*king miracle of being.'' It isn't other people that are standing in your way, it isn't even your circumstances that are blocking your ability to thrive, it's yourself and the negative self-talk you keep telling yourself.\n\nIn Unfu*k Yourself, Bishop leads you through a series of seven assertions:\n\nI am willing.\nI am wired to win.\nI got this.\nI embrace the uncertainty.\nI am not my thoughts; I am what I do.\nI am relentless.\nI expect nothing and accept everything.\n\nLead the life you were meant to have—Unfu*k Yourself.","link":"https://play.google.com/store/books/details/Gary_John_Bishop_Unfu_k_Yourself?id=UAjhDgAAQBAJ"},{"name":"The Way of Kings","author":"Brandon Sanderson","image":"https://books.google.com/books/content/images/frontcover/OHclhBVv-X4C?fife=w200-h300","description":"From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion.\n\nRoshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.\n\nIt has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.\n\nOne such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.\n\nBrightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.\n\nAcross the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.\n\nThe result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.\n\nSpeak again the ancient oaths:\n\nLife before death.\nStrength before weakness.\nJourney before Destination.\n\nand return to men the Shards they once bore.\n\nThe Knights Radiant must stand again.\n\nOther Tor books by Brandon Sanderson\n\nThe Cosmere\n\nThe Stormlight Archive\nThe Way of Kings\nWords of Radiance\nEdgedancer (Novella)\nOathbringer \n\nThe Mistborn trilogy\nMistborn: The Final Empire\nThe Well of Ascension\nThe Hero of Ages\n\nMistborn: The Wax and Wayne series\nAlloy of Law\nShadows of Self\nBands of Mourning\n\nCollection\nArcanum Unbounded\n\nOther Cosmere novels\nElantris\nWarbreaker\n\nThe Alcatraz vs. the Evil Librarians series\nAlcatraz vs. the Evil Librarians\nThe Scrivener's Bones\nThe Knights of Crystallia\nThe Shattered Lens\nThe Dark Talent\n\nThe Rithmatist series\nThe Rithmatist\n\nOther books by Brandon Sanderson\n\nThe Reckoners\nSteelheart\nFirefight\nCalamity\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Brandon_Sanderson_The_Way_of_Kings?id=OHclhBVv-X4C"},{"name":"The Way of Kings","author":"Brandon Sanderson","image":"https://books.google.com/books/content/images/frontcover/OHclhBVv-X4C?fife=w200-h300","description":"From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion.\n\nRoshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.\n\nIt has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.\n\nOne such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.\n\nBrightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.\n\nAcross the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.\n\nThe result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.\n\nSpeak again the ancient oaths:\n\nLife before death.\nStrength before weakness.\nJourney before Destination.\n\nand return to men the Shards they once bore.\n\nThe Knights Radiant must stand again.\n\nOther Tor books by Brandon Sanderson\n\nThe Cosmere\n\nThe Stormlight Archive\nThe Way of Kings\nWords of Radiance\nEdgedancer (Novella)\nOathbringer \n\nThe Mistborn trilogy\nMistborn: The Final Empire\nThe Well of Ascension\nThe Hero of Ages\n\nMistborn: The Wax and Wayne series\nAlloy of Law\nShadows of Self\nBands of Mourning\n\nCollection\nArcanum Unbounded\n\nOther Cosmere novels\nElantris\nWarbreaker\n\nThe Alcatraz vs. the Evil Librarians series\nAlcatraz vs. the Evil Librarians\nThe Scrivener's Bones\nThe Knights of Crystallia\nThe Shattered Lens\nThe Dark Talent\n\nThe Rithmatist series\nThe Rithmatist\n\nOther books by Brandon Sanderson\n\nThe Reckoners\nSteelheart\nFirefight\nCalamity\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","link":"https://play.google.com/store/books/details/Brandon_Sanderson_The_Way_of_Kings?id=OHclhBVv-X4C"},{"name":"Shadow Storm","author":"Christine Feehan","image":"https://books.google.com/books/publisher/content/images/frontcover/rcL3DwAAQBAJ?fife=w200-h300","description":"A long-simmering feud between two families comes to a head in this gripping novel in Christine Feehan's New York Times bestselling Shadow Riders series.\n \nAs the youngest member of the Ferraro family, Emmanuelle has watched each of her brothers find happiness in love while her own heart was shattered by a lover’s betrayal. For two years she’s stayed as far away from Valentino Saldi as possible—until she learns that he’s been shot during a hostile takeover of his family’s territory.\n \nEmme’s first instinct is to call her brother Stefano for help, and soon the entire Ferraro clan arrives to bring Val back from the brink of death and protect the Saldis from further attack. With one choice Emme has re-exposed herself to Val’s intoxicating pull and dragged her family into the Saldis’ private war.\n \nA deadly storm is brewing, and only time will tell who survives…","link":"https://play.google.com/store/books/details/Christine_Feehan_Shadow_Storm?id=rcL3DwAAQBAJ"},{"name":"Shadow Storm","author":"Christine Feehan","image":"https://books.google.com/books/publisher/content/images/frontcover/rcL3DwAAQBAJ?fife=w200-h300","description":"A long-simmering feud between two families comes to a head in this gripping novel in Christine Feehan's New York Times bestselling Shadow Riders series.\n \nAs the youngest member of the Ferraro family, Emmanuelle has watched each of her brothers find happiness in love while her own heart was shattered by a lover’s betrayal. For two years she’s stayed as far away from Valentino Saldi as possible—until she learns that he’s been shot during a hostile takeover of his family’s territory.\n \nEmme’s first instinct is to call her brother Stefano for help, and soon the entire Ferraro clan arrives to bring Val back from the brink of death and protect the Saldis from further attack. With one choice Emme has re-exposed herself to Val’s intoxicating pull and dragged her family into the Saldis’ private war.\n \nA deadly storm is brewing, and only time will tell who survives…","link":"https://play.google.com/store/books/details/Christine_Feehan_Shadow_Storm?id=rcL3DwAAQBAJ"},{"name":"A Game of Thrones","author":"George R. R. Martin","image":"https://books.google.com/books/content/images/frontcover/5NomkK4EV68C?fife=w200-h300","description":"NOW THE ACCLAIMED HBO SERIES GAME OF THRONES—THE MASTERPIECE THAT BECAME A CULTURAL PHENOMENON\n \nWinter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert’s name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse—unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season.\n \nYet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen’s brothers Jaime and Tyrion of the powerful and wealthy House Lannister—the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms.\n \nMeanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki—whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys.","link":"https://play.google.com/store/books/details/George_R_R_Martin_A_Game_of_Thrones?id=5NomkK4EV68C"},{"name":"A Game of Thrones","author":"George R. R. Martin","image":"https://books.google.com/books/content/images/frontcover/5NomkK4EV68C?fife=w200-h300","description":"NOW THE ACCLAIMED HBO SERIES GAME OF THRONES—THE MASTERPIECE THAT BECAME A CULTURAL PHENOMENON\n \nWinter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert’s name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse—unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season.\n \nYet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen’s brothers Jaime and Tyrion of the powerful and wealthy House Lannister—the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms.\n \nMeanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki—whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys.","link":"https://play.google.com/store/books/details/George_R_R_Martin_A_Game_of_Thrones?id=5NomkK4EV68C"},{"name":"The Awakening","author":"Nora Roberts","image":"https://books.google.com/books/publisher/content/images/frontcover/o1PEDwAAQBAJ?fife=w200-h300","description":"#1 New York Times bestselling author Nora Roberts begins a new trilogy of adventure, romance, and magick in The Awakening.\n\nIn the realm of Talamh, a teenage warrior named Keegan emerges from a lake holding a sword—representing both power and the terrifying responsibility to protect the Fey. In another realm known as Philadelphia, a young woman has just discovered she possesses a treasure of her own...\n\nWhen Breen Kelly was a girl, her father would tell her stories of magical places. Now she’s an anxious twentysomething mired in student debt and working a job she hates. But one day she stumbles upon a shocking discovery: her mother has been hiding an investment account in her name. It has been funded by her long-lost father—and it’s worth nearly four million dollars.\n\nThis newfound fortune would be life-changing for anyone. But little does Breen know that when she uses some of the money to journey to Ireland, it will unlock mysteries she couldn’t have imagined. Here, she will begin to understand why she kept seeing that silver-haired, elusive man, why she imagined his voice in her head saying Come home, Breen Siobhan. It’s time you came home. Why she dreamed of dragons. And where her true destiny lies—through a portal in Galway that takes her to a land of faeries and mermaids, to a man named Keegan, and to the courage in her own heart that will guide her through a powerful, dangerous destiny...","link":"https://play.google.com/store/books/details/Nora_Roberts_The_Awakening?id=o1PEDwAAQBAJ"},{"name":"The Awakening","author":"Nora Roberts","image":"https://books.google.com/books/publisher/content/images/frontcover/o1PEDwAAQBAJ?fife=w200-h300","description":"#1 New York Times bestselling author Nora Roberts begins a new trilogy of adventure, romance, and magick in The Awakening.\n\nIn the realm of Talamh, a teenage warrior named Keegan emerges from a lake holding a sword—representing both power and the terrifying responsibility to protect the Fey. In another realm known as Philadelphia, a young woman has just discovered she possesses a treasure of her own...\n\nWhen Breen Kelly was a girl, her father would tell her stories of magical places. Now she’s an anxious twentysomething mired in student debt and working a job she hates. But one day she stumbles upon a shocking discovery: her mother has been hiding an investment account in her name. It has been funded by her long-lost father—and it’s worth nearly four million dollars.\n\nThis newfound fortune would be life-changing for anyone. But little does Breen know that when she uses some of the money to journey to Ireland, it will unlock mysteries she couldn’t have imagined. Here, she will begin to understand why she kept seeing that silver-haired, elusive man, why she imagined his voice in her head saying Come home, Breen Siobhan. It’s time you came home. Why she dreamed of dragons. And where her true destiny lies—through a portal in Galway that takes her to a land of faeries and mermaids, to a man named Keegan, and to the courage in her own heart that will guide her through a powerful, dangerous destiny...","link":"https://play.google.com/store/books/details/Nora_Roberts_The_Awakening?id=o1PEDwAAQBAJ"},{"name":"That Summer: A Novel","author":"Jennifer Weiner","image":"https://books.google.com/books/publisher/content/images/frontcover/dLL_DwAAQBAJ?fife=w200-h300","description":"“Weiner, the undisputed boss of the beach read, is back with another stunner.” —The New York Times\n\n“That Summer Is Your *IDEAL* Beach Read.” —Cosmopolitan\n\nNamed a Most Anticipated Book of Spring 2021 by Marie Claire, Bustle, Good Morning America, CNN, PopSugar, Good Housekeeping, Frolic, Country Living, and Working Mother\n\nFrom the #1 New York Times bestselling author of Big Summer comes another deliciously twisty novel of intrigue, secrets, and the transformative power of female friendship.\n\nDaisy Shoemaker can’t sleep. With a thriving cooking business, full schedule of volunteer work, and a beautiful home in the Philadelphia suburbs, she should be content. But her teenage daughter can be a handful, her husband can be distant, her work can feel trivial, and she has lots of acquaintances, but no real friends. Still, Daisy knows she’s got it good. So why is she up all night?\n\nWhile Daisy tries to identify the root of her dissatisfaction, she’s also receiving misdirected emails meant for a woman named Diana Starling, whose email address is just one punctuation mark away from her own. While Daisy’s driving carpools, Diana is chairing meetings. While Daisy’s making dinner, Diana’s making plans to reorganize corporations. Diana’s glamorous, sophisticated, single-lady life is miles away from Daisy’s simpler existence. When an apology leads to an invitation, the two women meet and become friends. But, as they get closer, we learn that their connection was not completely accidental. Who IS this other woman, and what does she want with Daisy?\n\nFrom the manicured Main Line of Philadelphia to the wild landscape of the Outer Cape, written with Jennifer Weiner’s signature wit and sharp observations, That Summer is a story about surviving our pasts, confronting our futures, and the sustaining bonds of friendship.","link":"https://play.google.com/store/books/details/Jennifer_Weiner_That_Summer?id=dLL_DwAAQBAJ"},{"name":"The Unhoneymooners","author":"Christina Lauren","image":"https://books.google.com/books/publisher/content/images/frontcover/3kaBDwAAQBAJ?fife=w200-h300","description":"THE INSTANT NEW YORK TIMES BESTSELLER! \n\nStarred reviews from Kirkus Reviews * Publishers Weekly * Library Journal \n\nNamed a “Must-Read” by TODAY, Us Weekly, Bustle, BuzzFeed, Goodreads, Entertainment Weekly, Publishers Weekly, Southern Living, Book Riot, Woman’s Day, The Toronto Star, and more!\n\nFor two sworn enemies, anything can happen during the Hawaiian trip of a lifetime—maybe even love—in this romantic comedy from the New York Times bestselling authors of Roomies.\n\nOlive Torres is used to being the unlucky twin: from inexplicable mishaps to a recent layoff, her life seems to be almost comically jinxed. By contrast, her sister Ami is an eternal champion...she even managed to finance her entire wedding by winning a slew of contests. Unfortunately for Olive, the only thing worse than constant bad luck is having to spend the wedding day with the best man (and her nemesis), Ethan Thomas.\n\nOlive braces herself for wedding hell, determined to put on a brave face, but when the entire wedding party gets food poisoning, the only people who aren’t affected are Olive and Ethan. Suddenly there’s a free honeymoon up for grabs, and Olive will be damned if Ethan gets to enjoy paradise solo.\n\nAgreeing to a temporary truce, the pair head for Maui. After all, ten days of bliss is worth having to assume the role of loving newlyweds, right? But the weird thing is...Olive doesn’t mind playing pretend. In fact, the more she pretends to be the luckiest woman alive, the more it feels like she might be.\n\nWith Christina Lauren’s “uniquely hilarious and touching voice” (Entertainment Weekly), The Unhoneymooners is a romance for anyone who has ever felt unlucky in love.","link":"https://play.google.com/store/books/details/Christina_Lauren_The_Unhoneymooners?id=3kaBDwAAQBAJ"}]